{
  "introduction": "Aloha! My name is Elías García, I’m 23 years old and I’m currently living in A Coruña, Spain. I studied computer engineering at the University of A Coruña with a major in software engineering.",
  "degree": "Thanks to the degree I’ve been able to learn all kinds of programming languages as well as cross-cutting issues in all computing branches: operating systems, algorithms, data structures, parallelism and concurrency... In recent years I’ve specialized in the branch of software engineering, acquiring part of the knowledge on web applications that I have today: design patterns, software architectures, testing, CI, CD… That’s to say, I’ve known the bases of something that had just started for me!",
  "afterDegree": "Since then, I’ve decided to specialize, above all, in JavaScript technologies. Since I started the practices until today, I’ve worked mostly creating REST APIs of all kinds with frameworks such as Express or Nest.js, creating user interfaces with Angular and creating different CI and CD pipelines with Jenkins, Heroku… In addition to JavaScript, I also really like Java and Erlang. Also this year I hope to get some time to learn GO, which is quite fashionable thanks to Docker. Its concurrency model looks very good 🤓 Finally, as for the front-end, I'm working a lot with React lately due to the flexibility that it provides in front of Angular...",
  "freeTime": "In my spare time I take the time to learn new technologies through books, articles... What I love most is software architecture, craftsmanship and design patterns. Thanks to books such as Uncle Bob's Clean Architecture or Martin Fowler's articles I’ve learned architectures beyond REST API’s: microservices, event driven etc. Also more recently I’ve been introducing myself into serverless architectures, in how to build scalable, elastic and highly available distributed systems. Currently, I’m trying to deepen more in the Devops part. Everything I’m learning I always try to put it into practice in my side projects, there is always something to improve! Finally, I also like to attend tech talks in my city, whenever I have time and there is an interesting one I try to be there. In his day I’ve given an Angular talk and I really enjoyed it, so I hope to repeat some day too!",
  "ending": "As you can see, software and my side projects occupies a large part of my life, although I also like to travel, play paddle tennis, and above all, practice bodyboard when time permits (fortunately I’m surrounded by very good beaches in Galicia). And of course... I also like to go for some beers and enjoy the weekend with my family and friends! 🍻"
}